---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateFaceGeometryInfo(System.Double)
source: html/a2dd5b4f-d787-c938-3b71-16750d5aeccf.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateFaceGeometryInfo Method

Creates a new container object which holds IfcFace handles processed from a Revit geometry object.

## Syntax (C#)
```csharp
public static IFCGeometryInfo CreateFaceGeometryInfo(
	double epsilon
)
```

## Parameters
- **epsilon** (`System.Double`) - The epsilon value used to process surfaces.

## Returns
The new geometry info container.